package 배열;

public class 배열비교하기 {

	public static void main(String[] args) {
		// 이 문제에서 두 정수 배열의 대소관계를 다음과 같이 정의합니다.
		// 두 배열의 길이가 다르다면, 배열의 길이가 긴 쪽이 더 큽니다.
		// 배열의 길이가 같다면 각 배열에 있는 모든 원소의 합을 비교하여 다르다면 더 큰 쪽이 크고, 같다면 같습니다.
		// 두 정수 배열 arr1과 arr2가 주어질 때, 
		// 위에서 정의한 배열의 대소관계에 대하여 arr2가 크다면 -1, arr1이 크다면 1, 두 배열이 같다면 0을 return 하는 solution 함수를 작성해 주세요.		
		// 1 ≤ arr1의 길이 ≤ 100
		// 1 ≤ arr2의 길이 ≤ 100
		// 1 ≤ arr1의 원소 ≤ 100
		// 1 ≤ arr2의 원소 ≤ 100
		// 문제에서 정의한 배열의 대소관계가 일반적인 프로그래밍 언어에서 정의된 배열의 대소관계와 다를 수 있는 점에 유의해주세요.
		
		int[] arr1 = {100, 17, 84, 1, 1, 1};
		int[] arr2 = {55, 12, 65, 36, 100};
		
		// 1. if문을 두번 쓰거나 삼항연산자를 두번 써야함
		// 2. 그러면ㅅ 반복문을 써야하기 떄문에 삼항연산자 대신 if문을 쓰는 것이 좋겠다. 
		
		

	}

}
