package 형변환개념;

public class 미니정리 {

	public static void main(String[] args) {
		// 1. 기본형 형변환 중 아래 코드를 수정해보세요.
		int x = 100;
		byte y = (byte)x;
		
		// 2. 참조형 형 변환이 되는 조건은? - 상속관계
		// 3. 상속에서 위에 물려주는 클래스를 무엇이라고 부르는가? - 부모클래스, 수퍼클래스
		// 4. 상속에서 아래 물려받는 클래스를 무엇이라고 부르는가? - 자식클래스, 서브클랙스
		// 5. 상속을 사용할 때 키워드는 다음 중 무엇? - extends
		// 6. 기본형 데이터 4가지 - 문자,숫자,실수,논리
		// 7. 참조형 데이터 2가지 이상 - 클래스, 배열
		// 8. 참조형 형변환 중, 아래 코드를 수정해보세요.
//		Car c = new car();
//		Truck t = new Truck(); // Truck은 Car를 상속받아 만들었음.
//		t = c; // 수정해보세요 - t = (truck)c;
		// 9. 기본형, 참조형 변수에 각가 들어있는 것은? - 값, 주소
		// 10. 참조형 변수를 초기화하려고 한다, 무엇으로 초기화해야 할끼? - null
		// 11. null이란? - Ram의 쓰레기값을 방지하기 위해 임의로 만든 없는 값
		// 12. 포장클래스(wrapper class)란? 종류 2가지 - Integer, Charater
		// 13. 업캐스팅이란? - 자동형 형변환과 같은 말로, 작은 값을(자식클래스) 큰 값에(부모클래스)에 넣기
		// 14. 다운캐스팅이란? - 자동형 형변환과 같은 말로, 큰 값을 작은 값에 넣기
		
		

	}

}
